{
  "date": "2022-10-23T14:39:32.560Z",
  "title": "What is Shopify 2.0?",
  "image": "img/shopify.jpg",
  "body": "On the 29th of June, Shopify made an important announcement: Shopify 2.0. What exactly does that mean for your store? How important are these new features? Should you hurry to upgrade to it?\n\n## What is Shopify 2.0?\n\nShopify 2.0 is a new update to Shopify service with enhanced features and faster performance. The Shopify platform is the one which powers eCommerce for over a million businesses, so it's imperative that this company continues to introduce innovative product and service opportunities.\n\nWhile Shopify is one of the most versatile eCommerce platforms, there was a requirement for greater customization choices for landing pages and product pages specifically. With Shopify 2.0, the need for customized product pages is gone.\n\n\n\n### What are the new features and advantages of Online Store 2.0?\n\nThe main benefit of Shopify's online store 2.0 is that the administrator can more flexibly edit, change, and maintain this package. We have ranked the most notable features and their advantages below.\n\n\\-﻿TABLA COMO IMAGEN-\n\n\n\n### **Sections available on all pages**\n\nHave you heard the phrase, Sections everywhere? This feature is the most significant and eagerly anticipated enhancement for Shopify platform users.\\\n\\\nWhat are these “*sections”* and how do they improve customer experience and boost sales? \n\nSections are content blocks that you can put on your page to customize the look of your site. Sections everywhere indicate that you can now put these blocks on every page of your site.\n\nI﻿n the past, these sections were limited page by page, which made editing too complex and difficult. Some page builder apps like Shogun try to fix this, but they all came with their own set of new problems.\n\nB﻿ut with Shopify 2.0, you no longer need to use page builders to customize the content of your site. You can now reuse the same sections in different parts of your site. That is because you get a whole new world of opportunities to personalize your site and build customized landing pages that will increase sales and improve your customer satisfaction.\n\nOpportunities open up for the store owners when using this tool to their benefit.\n\n\n\n### **Amazing upgrade to Shopify’s metafields**\n\n*We’ve made a major update to metafields that makes it easier to manage your store’s metadata. From ingredient lists to customer details, you can now easily store and reference different types of metafields within Shopify. 🏷️ [pic.twitter.com/nQejqeByrv](https://t.co/nQejqeByrv)*\n\n*— Shopify (@Shopify) [June 29, 2021](https://twitter.com/Shopify/status/1409922963030351882?ref_src=twsrc%5Etfw)*\n\n\n\n2.0 made a massive upgrade to Shopify's metafields. You do not need to add an external app or laboriously hardcode the display of modifications to your template, you can now just edit your metafields through the new admin. The new content types are color, product, variant page, measurements, file, information, time, true, number, and evaluation.\n\n**N﻿ow you can:**\n\n\\-﻿Add extra content\n\n\\-﻿Add ingredient lists\n\n\\-Develop product specifications on a per-product basis\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n.",
  "excerpt": "Shopify 2.0 is a new update to Shopify service with enhanced features and faster performance. The Shopify platform is the one that powers eCommerce for over a million businesses, so it's imperative that this company continues to introduce innovative product and service opportunities."
}