{
  "date": "2022-10-22T01:13:07.428Z",
  "title": "Case 2",
  "image": "img/custom_development.png",
  "body": "## La Nativa:\n\nLa Nativa is a Swiss company with a social conscience that previously only sold clothes, and they wanted to steer the cafeteria and sustainable clothes. They wanted a Shopify that blended both concepts with an elegant yet casual style.\n\n## The Challenge:\n\nTheir previous WordPress site rashed all the time and was only geared towards clothing.\n\nThe problem to solve was to prevent them from losing more traffic, help them reduce the maintenance time of the site, and reorganize the site oriented towards both the cafeteria and the clothing store.\n\n## How we helped:\n\nWe worked with La Nativa team to identify several areas for improvement in their UX and UI across their store, mostly centered around the idea of communicating the pivot from clothing to coffee. We worked on their bespoke Shopify theme to make changes that highlighted their brand focus change, their catalog, made better use of their page space, and helped promote more of their pairing products for better upsells.\n\nFirst, we help them stabilize WordPress, with dynamic caches, Webp compressions, CDNs and JS/CSS cleanup. That way they didn't lose traffic while we converted to Shopify.\n\nThen we redesigned the experience, creating a fast and efficient Shopify for them. We did the migration of all your products and pages.\n\n## Highlights:\n\n\\-Improved the customer journey and UX on their Shopify product lists and product pages\n\n\\-Custom Shopify theme work across their website\n\n\\-Ongoing dedicated Shopify consultancy to support their store now and in the future\n\n\\-Shopify allows them to maintain efficient running costs, reducing the time required for maintenance.\n\n\\-Their previous WordPress site didn't go down during the moving process thanks to the optimizations we did.\n\n![](img/hero_back.jpg)\n\nNam vitae elit diam. Suspendisse aliquam sed quam in imperdiet. Sed lacus ex, tincidunt ac blandit non, viverra et quam. Aenean dignissim dictum est sed sagittis. Nulla et ullamcorper enim. Nunc viverra ex libero, sit amet suscipit lectus ultricies vel. Nulla magna neque, imperdiet et dictum a, interdum sed justo. Fusce in elementum augue, in interdum tellus. Maecenas purus eros, elementum sed risus vel, ultrices finibus turpis. Fusce non magna neque. Suspendisse tempor posuere nunc, sed vestibulum lectus tempus at. Duis nec porttitor justo. Pellentesque in eleifend ipsum.",
  "excerpt": "La Nativa is a Swiss company with a social conscience that previously only sold clothes, and they wanted to steer the cafeteria and sustainable clothes. They wanted a Shopify that blended both concepts with an elegant yet casual style."
}